In [ ]:
%load tutorial.db

In [ ]:
select * from employee

+-------+--------+------------+--------+
| empId | name   | supervisor | salary |
+-------+--------+------------+--------+
| 3     | Brad   | None       | 4000   |
+-------+--------+------------+--------+
| 1     | John   | 3          | 1000   |
+-------+--------+------------+--------+
| 2     | Dan    | 3          | 2000   |
+-------+--------+------------+--------+
| 4     | Thomas | 3          | 4000   |
+-------+--------+------------+--------+

## Write a solution to find the second highest salary from the Employee table. If there is no second highest salary, return null

In [ ]:
select * from employee where salary< (select max(salary) from employee)

+-------+------+------------+--------+
| empId | name | supervisor | salary |
+-------+------+------------+--------+
| 1     | John | 3          | 1000   |
+-------+------+------------+--------+
| 2     | Dan  | 3          | 2000   |
+-------+------+------------+--------+

In [ ]:
select max(salary) from employee where salary< (select max(salary) from employee)

+-------------+
| max(salary) |
+-------------+
| 2000        |
+-------------+